[
  {
    "title": "Data Roles, Small Language Models, Knowledge Graphs, and More: Our January Must-Reads",
    "link": "https://medium.com/data-science/data-roles-small-language-models-knowledge-graphs-and-more-our-january-must-reads-2a5047bb66e0?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n4\nListen\nShare\nThe Variable is moving soon—sign up here to ensure you receive all future newsletters.\nOur prolific authors delivered some excellent work this past month, channeling all the renewed energy and excitement we’ve come to expect from January on TDS. From career advice to core programming and data-processing tasks, our most-read and -shared articles in the past month cover the topics that data professionals care about the most as they plan their next move and aim to expand their skill set.\nWe invite you to explore this month’s must-reads with an open mind: from the ever-shifting terrain of job descriptions to the rise of small language models (alongside large ones), they tackle well-covered areas in data science and machine learning from a fresh, actionable, and pragmatic perspective. Let’s get started.\nEvery month, we’re thrilled to see a fresh group of authors join TDS, each sharing their own unique voice, knowledge, and experience with our community. If you’re looking for new writers to explore and follow, just browse the work of our latest additions from the past couple of months, including \n\nThank you for supporting the work of our authors! We love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "Building Successful AI Apps: The Dos and Don’ts",
    "link": "https://medium.com/data-science/building-successful-ai-apps-the-dos-and-donts-3e0fa027efe9?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n4\nListen\nShare\nAs businesses and organizations scramble to find good use cases for AI, several crucial questions consistently emerge: do you even need AI-powered tools? How should you go about building or integrating them into your existing workflows? And how will you know if the effort was worth it?\nWhether you’re an independent practitioner or part of a larger team trying to make sense of this emerging technology, you’ll find concrete and actionable insights in the lineup of articles we’ve selected this week. They each tackle the nuts and bolts of building AI apps and leveraging their potential for well-defined goals, while avoiding common pain points.\nWhile these posts zoom in on specific topics and business problems, they all offer a pragmatic, accessible approach, making them useful for readers across a wide spectrum of backgrounds and experience levels. Let’s dive in.\nBranching out into the world beyond AI apps, we’ve selected a few more recommended reads we thought you’d enjoy—from a beginner-friendly intro to LLMs to an in-depth analysis of data strategies.\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "Charts, Dashboards, Maps, and More: Data Visualization in the Spotlight",
    "link": "https://medium.com/data-science/charts-dashboards-maps-and-more-data-visualization-in-the-spotlight-67d71ddf6614?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n1\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nBuzzwords and trends come and go, but the core task of telling compelling stories with data remains one of the main pillars in data scientists’ daily workflow. For practitioners who’d like to up their visualization game, this week we’re highlighting some of our best recent articles on creating powerful, effective, and sleek deliverables.\nOur selection tackles the topic from multiple angles, so whether you’re interested in chart optimization, geospatial aids, or interactive dashboards, we’re sure you’ll find something here to inspire you and help you expand your current skill set. Happy tinkering!\nA new year often brings with it a rush of excellent new writing, and so far 2025 has not disappointed on that front. Here are several recent standouts on a wide range of topics, from hands-on AI projects to the history of GPT models.\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "LLM Evaluation, Parallel Computing, Demand Forecasting, and Other Hands-On Data Science Approaches",
    "link": "https://medium.com/data-science/llm-evaluation-parallel-computing-demand-forecasting-and-other-hands-on-data-science-approaches-445f684b01dc?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n2\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nAs we all settle into the sometimes hectic rhythm of a new year, we hope you’ve been enjoying the excitement of kicking off projects, learning about new topics, and exploring your next career moves. We’re definitely seeing a flurry of activity among our authors—both longstanding contributors and recent additions—and are thrilled to share all the great work they’ve been cooking up over the holidays.\nOur lineup of top-notch reads this week has a distinctly actionable, hands-on flavor to it—after all, what better way to harness all this energy than by tinkering with some datasets, models, and code? Whether you’re interested in learning more about cutting-edge evaluation methods or building agentic-AI tools, we’ve got you covered with a diverse selection of tutorials and practical overviews. Ready to dive in?\nIf you’re ready to branch out into other topics this week, we’re here to help—whether your interests lie at the intersection of music and AI, quantum computing, or linear algebra (among others), we hope you explore some of these excellent articles:\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "Start a New Year of Learning on the Right Foot",
    "link": "https://medium.com/data-science/start-a-new-year-of-learning-on-the-right-foot-1469b3d45348?source=rss-7e12c71dfa81------2",
    "fullContent": "--\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nHappy new year! Welcome back to the Variable!\nThe ink has barely dried on our 2024 highlights roundup (it’s never too late to browse it, of course), and here we are, ready to dive headfirst into a fresh year of learning, growth, and exploration.\nWe have a cherished tradition of devoting the first edition of the year to our most inspiring—and accessible—resources for early-stage data science and machine learning professionals (we really do!). We continue it this year with a selection of top-notch recent articles geared at beginner-level learners and job seekers. For the rest of our readers, we’re thrilled to kick things off with a trio of excellent posts from industry veterans who reflect on the current state of data science and AI, and share their opinionated, bold predictions for what the year ahead might look like. Let’s get started!\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors; if contributing to TDS in 2025 is one of your new year’s resolutions—or even if you’ve just recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics—don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "2024 Highlights: The AI and Data Science Articles That Made a Splash",
    "link": "https://medium.com/data-science/2024-highlights-the-ai-and-data-science-articles-that-made-a-splash-2c0979b4d595?source=rss-7e12c71dfa81------2",
    "fullContent": "Featured\n--\n6\nListen\nShare\nFeeling inspired to write your first TDS post before the end of 2024? We’re always open to contributions from new authors.\nAnd just like that, 2024 is (almost) in the books. It was a year of exciting transitions — both for the TDS team and, in many meaningful ways, for the data science, machine learning, and AI communities at large. We’d like to thank all of you—readers, authors, and followers—for your support, and for keeping us busy and engaged with your excellent contributions and comments.\nUnlike in 2023, when a single event (ChatGPT’s launch just weeks before the beginning of the year) stopped everyone in their tracks and shaped conversations for months on end, this year we experienced a more cumulative and fragmented sense of transformation. Practitioners across industry and academia experimented with new tools and worked hard to find innovative ways to benefit from the rapid rise of LLMs; at the same time, they also had to navigate a challenging job market and a world where AI’s footprint inches ever closer to their own everyday workflows.\nTo help you make sense of these developments, we published more than 3,500 articles this past year, including hundreds from first-time contributors. Our authors have an incredible knack for injecting their unique perspective into any topic they cover—from big questions and timely topics to more focused technical challenges—and we’re proud of every post we published in 2024.\nWithin this massive creative output, some articles manage to resonate particularly well with our readers, and we’re dedicating our final Variable edition to these: our most-read, -discussed, and -shared posts of the year. As you might expect, they cover a lot of ground, so we’ve decided to arrange them following the major themes we’ve detected this year: learning and building from scratch, RAG and AI agents, career growth, and breakthroughs and innovation.\nWe hope you enjoy exploring our 2024 highlights, and we wish you a relaxing end of the year — see you in January!\nThe most reliably popular type of TDS post is the one that teaches readers how to do or study something interesting and productive on their own, and with minimal prerequisites. This year is no exception—our three most-read articles of 2024 fall under this category.\nOnce the initial excitement surrounding LLMs settled (a bit), data and ML professionals realized that these powerful models aren’t all that useful out of the box. Retrieval-augmented generation and agentic AI rose to prominence in the past year as the two leading approaches that bridge the gap between the models’ potential and real-world value; they also ended up being our most covered technical topics in recent months.\nData science and machine learning career paths continue to evolve, and the need to adapt to this changing terrain can generate nontrivial amounts of stress for many professionals, whether they’re deep into their career or are just starting out. We love publishing personal reflections on this topic when they also offer readers pragmatic advice—here are four that stood out to us (and to our readers).\nStaying up-to-date with cutting-edge research and new tools can feel overwhelming at times, which is why we have a particular soft spot for top-notch paper walkthroughs and primers on emerging libraries and models. Here are three such articles that particularly resonated with our audience.\nThank you for supporting the work of our authors in 2024! If writing for TDS is one of your goals for 2025, why not get started now? Don’t hesitate to share your work with us.\nUntil the next Variable, coming your way in the first week of January,\nTDS Team"
  },
  {
    "title": "The Economics of Artificial Intelligence, Causal Tools, ChatGPT’s Impact, and Other Holiday Reads",
    "link": "https://medium.com/data-science/the-economics-of-artificial-intelligence-causal-tools-chatgpts-impact-and-other-holiday-reads-40e7793abffb?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n2\nListen\nShare\nFeeling inspired to write your first TDS post before the end of 2024? We’re always open to contributions from new authors.\nOur guiding principle is that it’s never a bad time to learn new things, but we also know that different moments call for different types of learning. Here at TDS, we’ve traditionally published lots of hands-on, roll-up-your-sleeves guides and tutorials as soon as we kick off a new year—and we’re sure that will be the case come January 2025, too.\nFor now, as we enter the peak of the holiday season, we wanted to highlight some of our best recent articles that call for a bit more reflection and a slower pace of processing: stories you can savor as you lounge on a comfy armchair, say, rather than while typing code away on your laptop (though you can do that too, of course; we won’t hold it against you!).\nFrom the cultural impact of AI-generated content to a Bayesian analysis of dogs’ pooping habits (yes, you’ve read that right), we hope you enjoy this lineup of thought-provoking, engaging articles. And stay tuned: we can’t wait to share our 2024 highlights with you in next week’s final-edition-of-the-year Variable.\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "How to Transition Into Data Science-and Within Data Science",
    "link": "https://medium.com/data-science/how-to-transition-into-data-science-and-within-data-science-9d8aac763d10?source=rss-7e12c71dfa81------2",
    "fullContent": "--\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nWith January just around the corner, we’re about to enter prime career-moves season: that exciting time of the year when many data and machine learning professionals assess their career growth and explore new opportunities, and newcomers to the field plan the next steps towards landing their first job. (It’s also when companies tend to ramp up their hiring after the end-of-year lull.)\nAll this energy often comes with nontrivial amounts of uncertainty, stress, and the occasional moment of self-doubt. To help you calmly chart your own path and avoid unnecessary second-guessing (of yourself as well as of hiring teams, colleagues, and others), we put together a special edition of the Variable focused on career transitions for both new and current practitioners.\nWe never miss a chance to celebrate data scientists’ diverse professional and academic backgrounds, and the lineup of articles we’re presenting here reflects that range, too. Whether you’re thinking about a switch to management, are about to jump into your first startup job, or are in the midst of transitioning to data science from a totally different discipline, you’ll find some concrete, experience-based insights to learn from.\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "Autonomous Agent Ecosystems, Data Integration, Open Source LLMs, and Other November Must-Reads",
    "link": "https://medium.com/data-science/autonomous-agent-ecosystems-data-integration-open-source-llms-and-other-november-must-reads-a8bafb49f0b7?source=rss-7e12c71dfa81------2",
    "fullContent": "--\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nWelcome to the penultimate monthly recap of 2024 — could we really be this close to the end of the year?! We’re sure that you, like us, are hard at work tying up loose ends and making a final push on your various projects. We have quite a few of those on our end, and one exciting update we’re thrilled to share with our community already is that TDS is now active on Bluesky. If you’re one of the many recent arrivals to the platform (or have been thinking about taking the plunge), we encourage you to follow our account.\nWhat else is on our mind? All the fantastic articles our authors have published in recent weeks, inspiring our readers to learn new skills and explore emerging topics in data science and AI. Our monthly highlights cover a lot of ground—as they usually do—and provide multiple accessible entryways into timely technical topics, from knowledge graphs to RAG evaluation. Let’s dive in.\nEvery month, we’re thrilled to see a fresh group of authors join TDS, each sharing their own unique voice, knowledge, and experience with our community. If you’re looking for new writers to explore and follow, just browse the work of our latest additions, including \n\nThank you for supporting the work of our authors! We love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  },
  {
    "title": "Getting Started with Multimodal AI, One-Hot Encoding, and Other Beginner-Friendly Guides",
    "link": "https://medium.com/data-science/getting-started-with-multimodal-ai-one-hot-encoding-and-other-beginner-friendly-guides-c93d766c86ec?source=rss-7e12c71dfa81------2",
    "fullContent": "--\n1\nListen\nShare\nFeeling inspired to write your first TDS post? We’re always open to contributions from new authors.\nTaking the first step towards mastering a new topic is always a bit daunting—sometimes it’s even very daunting! It doesn’t matter if you’re learning about algorithms for the first time, dipping your toes into the exciting world of LLMs, or have just been tasked with revamping your team’s data stack: taking on a challenge with little or no prior experience requires nontrivial amounts of courage and grit.\nThe calm and nuanced perspective of more seasoned practitioners can go a long way, too — which is where our authors excel. This week, we’ve gathered some of our standout recent contributions that are tailored specifically to the needs of early-stage learners attempting to expand their skill set. Let’s roll up our sleeves and get started!\nReady to venture out into other topics and challenges this week? We hope so—we’ve published some excellent articles recently on LLM apps, Python-generated art, AI ethics, and more:\nThank you for supporting the work of our authors! As we mentioned above, we love publishing articles from new authors, so if you’ve recently written an interesting project walkthrough, tutorial, or theoretical reflection on any of our core topics, don’t hesitate to share it with us.\nUntil the next Variable,\nTDS Team"
  }
]